//arguments == params(C#) всі крім стрілокових! Але це ОБ'ЄКТ
//Навіть якщо функція не приймає агрументів ми все рівно можем передати в неї аргументи
//Деякі параметри які задані за замовчуванням можна скіпнути комою(OPTIONS)
//Стрілкові какані в них argumnets не працює, а під час використання this стрілкові будуть вказувати
//refernce на загальний об'єкт, а не на теперішній загальний глобальний, якщо виривати з контексту то буде теж саме, !
//На функції можна виликати ToString аби побачити її, також (Bind - вже є в стрілкових, Call, Apply)
//////////////////////////
//Замикання(CLOSURES)
let a =5;
function f(b) {
    const f2 = function(c) {
        console.log(a,b,c);
    }
    return f2;
}
var f2 = f(10);
f2(3);
/////////////////////////